/**
 * Добавьте в класс Buildings со статическими методами обработки 
 * реализацию метода Floor synchronizedFloor (Floor floor), 
 * возвращающего ссылку на оболочку указанного объекта этажа, 
 * безопасную с точки зрения многопоточности.
 * Для этого потребуется в пакете buildings описать новый класс декоратора 
 * SynchronizedFloor, реализующий с обеспечением синхронизации 
 * методы интерфейса Floor, а также перегружающий ряд методов класса Object. 
 * Создание специальных итераторов и их синхронизация не требуются.
 */

package buildings;

public class SynchronizedFloor {

}
