/**
 * Создайте класс OfficeFloor этажа офисного здания.
 * Работа класса должна быть основана на односвязном циклическом списке офисов с выделенной головой.
 * Номер офиса явно не хранится.
 */
public class OfficeFloor {

    /**
     * Создайте приватный метод получения узла по его номеру.
     */
	 
    /**
	 * Создайте приватный метод добавления узла в список по номеру.
     */
	
	/**
	* Создайте приватный метод удаления узла из списка по его номеру.
    */
	
	/**
	* Конструктор может принимать количество офисов на этаже.
    */ 
	
	/**
	* Конструктор может принимать массив офисов этажа.
    */
	
	/**
	* Создайте метод получения количества офисов на этаже.
    */
	
	/**
	* Создайте метод получения общей площади помещений этажа.
    */
	
	/**
	* Создайте метод получения общего количества комнат этажа.
    */
	
	/**
	* Создайте метод получения массива офисов этажа.
    */
	
	/**
	* Создайте метод получения офиса по его номеру на этаже.
    */
	
	/**
	* Создайте метод изменения офиса по его номеру на этаже и ссылке на обновленный офис.
    */
	
	/**
	* Создайте метод добавления нового офиса на этаже по будущему номеру офиса.
    */
	
	/**
	* Создайте метод удаления офиса по его номеру на этаже.
    */
	
	/**
	* Создайте метод getBestSpace() получения самого большого по площади офиса этажа.
	*/
}
